{"https://www.factorybuys.com.au/products/euro-top-mattress-king": {"Factory Buys 32cm Euro Top Mattress - King": "Description\nIncorporating the cutting-edge technology, the lavish construction addresses all elements that will offer you a comfortable and luxurious experience - Euro top padding with high-density foam and an independent coil system - made to provide you with an undisturbed sleep all night long.\nProduct Features\n5 zoned pocket springs - Different levels of support\nIndependent coil system - Excellent support and sublime comfort\n6 working turn coil system\nHigh-density foam\nMedium firmness\nHypo-allergic material\nLuxury knitted jacquard fabric\nSide handles for positioning\nVacuum packaging: The item will expand to its normal shape within 1 day after unpacking\nCare Instructions\nDo not machine wash\nDo not bleach\nDo not iron\nDo not dry clean\nDo not saturate with water or other cleaning liquids\nTreat spills with a cloth and dry with a blow dryer\nIt May be spot cleaned with water or soap\nRotate mattress regularly\nVacuum using low suction\nDimensions & Specs\n|Dimensions\n|Width\n|Height\n|Depth\n|Product\n|183cm\n|32cm\n|203cm\n|Package\n|30cm\n|30cm\n|188cm\nSpecificationsSize: King\nNumber of coils: 928\nFirmness: 5. 0 / Medium\nThickness: 32cm\nDimensions: 203cm x 183cm x 32cm\nWhat’s Included\nFactory Buys 32cm Euro Top Mattress - King\nSave $475!\nSave $475!\nLeaves warehouse in 1-2 business days\nLearn more.\nDescription\nIncorporating the cutting-edge technology, the lavish construction addresses all elements that will offer you a comfortable and luxurious experience - Euro top padding with high-density foam and an independent coil system - made to provide you with an undisturbed sleep all night long.\nProduct Features\n5 zoned pocket springs - Different levels of support\nIndependent coil system - Excellent support and sublime comfort\n6 working turn coil system\nHigh-density foam\nMedium firmness\nHypo-allergic material\nLuxury knitted jacquard fabric\nSide handles for positioning\nVacuum packaging: The item will expand to its normal shape within 1 day after unpacking\nCare Instructions\nDo not machine wash\nDo not bleach\nDo not iron\nDo not dry clean\nDo not saturate with water or other cleaning liquids\nTreat spills with a cloth and dry with a blow dryer\nIt May be spot cleaned with water or soap\nRotate mattress regularly\nVacuum using low suction\nDimensions & Specs\n|Dimensions\n|Width\n|Height\n|Depth\n|Product\n|183cm\n|32cm\n|203cm\n|Package\n|30cm\n|30cm\n|188cm\nSpecificationsSize: King\nNumber of coils: 928\nFirmness: 5. 0 / Medium\nThickness: 32cm\nDimensions: 203cm x 183cm x 32cm\nWhat’s Included\nWarranty Information\nSome items come with a 12 month warranty which you may seek a refund or replacement for the item.\nExtended warranties for your peace of mind may also be available for some items. Please refer to the item listing for warranty period.\nThe warranty periods apply from the date of purchase of the product and any claim under this warranty must be made within 12 months\nSubject to the terms and conditions of this warranty, where your goods are defective within 12 months of your purchase, Factory Buys agrees to repair the goods, provide you with a replacement or provide you with store credit or a refund for the full amount of the purchase price (in the event that it is not possible to repair the goods or a replacement is unavailable).\nFrequently Bought Together\nSavannah Grey Bed Frame Fabric Gas Lift Storage - King\nAzalea LED Bed Frame PU Leather Gas Lift Storage - Black King\nSave $495!\nSave $495!\nFlorence Metal Bed Frame Base Platform - Black King\nSave $221!\nSave $221!\nLucca Bed Frame Fabric Gas Lift Storage - Grey King\nSave $659!\nSave $659!\nKING Sheets Fitted Flat Bed Sheet Pillowcases - Summer Grey\nSave $76!\nSave $76!\nKING Mattress Topper 100% Wool Underlay Reversible Mat Pad Protector\nSave $127!\nSave $127!\nKING Mattress Topper Bamboo Fibre Pillowtop Protector\n- Choosing a selection results in a full page refresh.", "Buy Factory Buys Euro Top Mattress - King Single Online in Australia": "Description\nIncorporating the cutting-edge technology, the lavish construction addresses all elements that will offer you a comfortable and luxurious experience - Euro top padding with high-density foam and an independent coil system - made to provide you with an undisturbed sleep all night long.\nProduct Features\n5 zoned pocket springs - Different levels of support\nIndependent coil system - Excellent support and sublime comfort\n6 working turn coil system\nHigh-density foam\nMedium firmness\nHypo-allergic material\nLuxury knitted jacquard fabric\nSide handles for positioning\nVacuum packaging: The item will expand to its normal shape within 1 day after unpacking\nCare Instructions\nDo not machine wash\nDo not bleach\nDo not iron\nDo not dry clean\nDo not saturate with water or other cleaning liquids\nTreat spills with a cloth and dry with a blow dryer\nIt May be spot cleaned with water or soap\nRotate mattress regularly\nVacuum using low suction\nDimensions & Specs\n|Dimensions\n|Width\n|Height\n|Depth\n|Product\n|107cm\n|32cm\n|203cm\n|Package\n|30cm\n|30cm\n|112cm\nSpecificationsSize: King Single\nNumber of coils: 576\nFirmness: 5. 0 / Medium\nThickness: 32cm\nDimensions: 203cm x 107cm x 32cm\nWhat’s Included\nFactory Buys 32cm Euro Top Mattress - King Single\nSave $318!\nSave $318!\nLeaves warehouse in 1-2 business days\nLearn more.\nDescription\nIncorporating the cutting-edge technology, the lavish construction addresses all elements that will offer you a comfortable and luxurious experience - Euro top padding with high-density foam and an independent coil system - made to provide you with an undisturbed sleep all night long.\nProduct Features\n5 zoned pocket springs - Different levels of support\nIndependent coil system - Excellent support and sublime comfort\n6 working turn coil system\nHigh-density foam\nMedium firmness\nHypo-allergic material\nLuxury knitted jacquard fabric\nSide handles for positioning\nVacuum packaging: The item will expand to its normal shape within 1 day after unpacking\nCare Instructions\nDo not machine wash\nDo not bleach\nDo not iron\nDo not dry clean\nDo not saturate with water or other cleaning liquids\nTreat spills with a cloth and dry with a blow dryer\nIt May be spot cleaned with water or soap\nRotate mattress regularly\nVacuum using low suction\nDimensions & Specs\n|Dimensions\n|Width\n|Height\n|Depth\n|Product\n|107cm\n|32cm\n|203cm\n|Package\n|30cm\n|30cm\n|112cm\nSpecificationsSize: King Single\nNumber of coils: 576\nFirmness: 5. 0 / Medium\nThickness: 32cm\nDimensions: 203cm x 107cm x 32cm\nWhat’s Included\nWarranty Information\nSome items come with a 12 month warranty which you may seek a refund or replacement for the item.\nExtended warranties for your peace of mind may also be available for some items. Please refer to the item listing for warranty period.\nThe warranty periods apply from the date of purchase of the product and any claim under this warranty must be made within 12 months\nSubject to the terms and conditions of this warranty, where your goods are defective within 12 months of your purchase, Factory Buys agrees to repair the goods, provide you with a replacement or provide you with store credit or a refund for the full amount of the purchase price (in the event that it is not possible to repair the goods or a replacement is unavailable).\nFrequently Bought Together\nTrenton Bed Frame Fabric - Grey King Single\nSave $151!\nSave $151!\nMimosa Gas Lift Bed Frame Base With Storage Platform Fabric - Grey King Single\nSave $248!\nSave $248!\nKyoto Black Metal Bed Frame - King Single\nSave $193!\nSave $193!\nSavannah Bed Frame PU Leather Gas Lift Storage - White King Single\nSave $332!\nSave $332!\nKING SINGLE 700GSM Merino Wool Quilt 160x210cm - White\nSave $132!\nSave $132!\nKING SINGLE Towel Waterproof Mattress Protector Cover Fully Zipper - Grey\nKING SINGLE Mattress Topper Bamboo Fibre Pillowtop Protector\nSave $82!\nSave $82!\n- Choosing a selection results in a full page refresh."}, "https://dunlin.com.au/products/beadlight-cirrus": {"Beadlight Cirrus LED Reading Light\n– Dunlin Home": "Beadlight Cirrus LED Reading Light\nHandmade by Beadlight in the UK, the Cirrus collection was originally designed for use in private jet aircraft, and first and business class cabins. The range has proved incredibly successful in hotels, private residences and mega yachts. Built to the exacting standards demanded by the aeropsace industry, each Beadlight reading light is made by hand and wrapped in English leather with hand stitching.\n- Ideal as a bedhead light, the luxurious fitting provides two brightness settings for reading.\n- Can be mounted to existing walls and bed heads.\n- Simple installation is required by an electrician.\n- Energy Efficient. These LED lights become the perfect solution to make substantial energy savings.\n- The wall lights use 1.4 watts of energy and require a 12v transformer, not included.\n- Previously available only to architects and interior designers, the Beadlight collection is now available to the public exclusively through Dunlin.\n- Overall Length from wall 45cm"}, "https://themodern.net.au/products/hamar-plant-stand-ash": {"Hamar Plant Stand - Ash\n– The Modern": "Introducing our Styling Service! Find out more\nIntroducing our Styling Service! Find out more\nStorewide Sale ON NOW! 20 - 40% OFF - Discount applied at cart\nStorewide Sale ON NOW! 20 - 40% OFF - Discount applied at cart\nWelcome to our home. If you love what you see here get more inspiration from us delivered to your mailbox, by signing up below!\nThe Hamar Plant Stand is a wonderful accessory that holds at least three pot plants or other objects such as vases, sculptural objects or lamps. Use it to fill a corner or that tricky spot, bring height and greenery to your room.\nDimensions: 65cm at widest point x 60cm (D) x 92cm (H)\nEach platform has 28cm (W) x 28cm (D) of useable space.\nMaterials: Solid Ash, Clear Lacquer\nSubscribe today to hear about new releases and promotions"}, "https://furniturefetish.com.au/products/oslo-office-chair-white": {}, "https://hemisphereliving.com.au/products/": {"hemisphereliving.com.au | 520: Web server is returning an unknown error": "Search for: (07) 5556 0693 [email protected] 130 Siganto Drive, Helensvale, QLD, 4212 Home > Products Products On Sale Sale! Alexander 3 Seater Sofa $2,795.00 $1,595.00 Sale! Simja 6 Piece Alfresco Setting $3,200.00 $1,995.00 Sale! Recycled Pine TV Cabinet $2,495.00 $1,695.00 Sale! Yukon 2.8m Dining Table $1,995.00 $795.00"}, "https://home-buy.com.au/products/bridger-pendant-larger-lamp-metal-brass": {}, "https://interiorsonline.com.au/products/interiors-online-gift-card": {"Gift Cards | RJ Living": "Returns & RefundsRead more\nYou are viewing out of products\nYou may also like\nVendor:\nMuse 6 Drawer Chest - Oak\nSpend $2000 Save 15%\nRegular price $2,499\nRegular priceUnit price per\nSale price\n$2,499\nVendor:\nRed Tulips Print\nSpend $500 Save 10%\nRegular price $109\nRegular priceUnit price per\nSale price\n$109\nVendor:\nRenew Armchair - Corduroy\nSpend $500 Save 10%\nRegular price $1,299\nRegular priceUnit price per\nSale price\n$1,299\nVendor:\nGroove Sideboard - Oak\nSpend $2000 Save 15%\nRegular price $2,299\nRegular priceUnit price per\nSale price\n$2,299\nVendor:\nBoucle Stripe Cushion - Tan Peach\nSpend $500 Save 10%\nRegular price $175\nRegular priceUnit price per\nSale price\n$175\nVendor:\nGather Dining Table - 200cm\nSpend $2000 Save 15%\nRegular price $2,299\nRegular priceUnit price per\nSale price\n$2,299\nGift Cards"}, "https://beckurbanfurniture.com.au/products/page/2/": {}, "https://livingedge.com.au/products/tables/dining": {"Dining Tables | Living Edge": "Refine by Category close Chairs Refine by Category: Chairs Tables Refine by Category: Tables Dining Tables Refine by Category: Dining Tables Desks Refine by Category: Desks Outdoor Tables Refine by Category: Outdoor Tables Collaborative Refine by Category: Collaborative"}, "https://edenliving.online/collections/summerloving/products/nice-lounge-1": {}, "https://www.ourfurniturewarehouse.com.au/products/athens-3pce-lounge-includes-2x-armless-3-seater-and-corner-ottoman-in-grey-storm-fabric?_pos=1&_sid=9f9ca4320&_ss=r": {}, "https://cane-line.co.uk/collections/news-2020/products/breeze-sunbed-5569": {}, "https://haute-living.com/products/beam-desk": {}, "https://www.knoll.com/design-plan/products/by-designer/knoll": {"Designer Florence Knoll | Knoll": "Featured Designer\nFlorence Knoll\nIn 1941 Florence Schust moved to New York after graduating from Cranbrook and working with many of the greatest architects in the world. There she met Hans Knoll, who was establishing a new furniture company. With Florence’s design skills and Hans’ business acumen and salesmanship, the pair, who married in 1946, grew the nascent company into an international arbiter of style and design. Florence also seeded contributions with her friends Eero Saarinen, Harry Bertoia, and Mies van der Rohe.read more"}, "https://www.balirepublic.com.au/products/fabric-cleaner": {"Balirepublic.com.au": "This domain may be for sale.\nBalirepublic.com.au\nRelated Searches:\nGarden Furniture\nOutdoor Furniture\nLuxury Furniture\nPrivacy Policy\n|\nCookie settings\n|\nDo Not Sell or Share My Personal Information"}, "https://vastinterior.com.au/products/samson-daybed-single-2": {"Samson Daybed Single": "Samson Daybed Frame - Single\nETA Mid September\nSize\nPLEASE NOTE: Pre orders are separated from our regular stock purchases. Please create a seperate order for each pre-order product type. We just need a 20% deposit to secure your items.\nNote: This is a frame only. Does not come with mattress or cover. Mattress and cover can be purchased separately.\nA Vast Icon, the Samson Daybed is a simple design, beautifully executed.\nCrafted from solid mango hardwood, and hand finished with 4 coats of hard wearing NC lacquer, this daybed is designed to last for decades. While we sell many of these for inside use, it is also perfectly suited for a covered veranda.\nThe timber used in this piece is sustainably sourced Mango Wood. Each plank is individually treated in a computer controlled kiln to reduce the chance of any cracks or warping in its long future as a furniture component.\nThis piece has been handcrafted by one of our Vast Masters, these individual cabinet makers have been manufacturing Vast products for over a decade. Using traditional joinery techniques to maximise the timber's natural beauty is a big part of the unique look of each Vast product. We call this \"working with the grain\". After the joinery is complete it is then hand sanded and hand polished with several coats of high grade German lacquer so it will last for generations!\nCountry of Origin: India\nHardwood is a natural material which reacts to its environment and although our manufacturing process allows for normal expansion and contraction, extreme high or low humidity may cause more swelling than normal. To minimise movement and ensure longevity of your purchase we recommend taking good care of your piece as outlined below:\n- Dust regularly with a clean cotton cloth;\n- Use tablecloths, table runners and coasters to help prevent scratches to the surface and wipe up any spills immediately;\n- To nourish and protect your furniture we recommend waxing with a natural beeswax every 6-12 months.\n- Only use natural wax, oil or water based cleaning products. Do not use solvent based cleaning products that may contain silicone or alcohol, as this may react and permanently damage the lacquer.\n- Do not expose to fragrant oils, insect repellent lotion, or nail polish remover as these are often solvent based and will damage the lacquer\n- Avoid placing your furniture near fireplaces, in direct sunlight or under heating/cooling vents.\n- Do not leave hot items or ice cold items directly on the surface of the table as water marking may occur.\n- Any metal work featuring on your product has been powder coated. Any damage to the surface should be contained as soon as possible to prevent rusting.\nProduct Specs\nBox 1 (top) 220 x 90 x 13cm. Box 2 (Legs): 89 x 95 x 15cm\nTotal Weight:49kg\nPACK TYPE: Flat Pack\nASSEMBLY: Partially Assembled, Easy Build\nMATERIALS: Mango Timber\nPLEASE NOTE: This is a naturally hand crafted product so slight variations in sizing will occur. All measurements are in cm.\nOur product images are taken in a studio environment. Please allow for colour variations depending on your monitor settings, device & the lighting environment in your home.\nDelivery costs\nTo calculate your delivery costs, please select your desired products and enter your postcode at the cart page. Shipping costs are calculated based on the weight and volume of the order, delivery destination & any special requirements of your property. Please note that Vast Furniture & Homewares only deliver to mainland Australia, we do not deliver to addresses that require barge or off-mainland access. We do not deliver to PO Boxes. It is the duty of the customer to provide Vast Furniture & Homewares with truthful and accurate details of the delivery destination at the time of checkout. Extra costs will be incurred and charged to the customer for delivery to a property that has more than 3 flights of stairs or to a property which has a longer driveway than a standard and reasonable residential driveway.\nEstimated delivery date\nVast Furniture & Homewares endeavours to have all customers contacted by our team within 24-48 hours after successful completion of your order. We endeavour to have all orders dispatched from our warehouse within 2 business days in selected areas only & regional destinations within 7-10 days after contact by our delivery team. Estimated delivery times will depend on where your product is being delivered. If the products are not available for immediate delivery, you will be contacted by our team to advise of an estimated delivery date. We shall use all reasonable endeavours to meet the estimated delivery date, however there may be circumstances beyond our control which may extend the fulfilment date.\nDelivery requirements\nVast Furniture & Homewares requires the person accepting delivery onsite to be over 18 years of age. This person may be asked to provide the driver with proof of their identity and/or age. If it is proved that this person is under 18 years of age than the products will be returned to our depot and all charges relating to storage and re-delivery will be payable by the customer. This person will need to sign for the goods and confirm that they are in good order and condition at the time of delivery. This person will also need to sign to confirm that no property damage has occurred during the deliver. Delivery will take place at the address listed on the sale invoice. If no one is at home for a scheduled delivery, a delivery fee will apply for all re-deliveries payable by the customer. It is the responsibility of the customer to organise the re-delivery.\nLost or damaged product\nWhile Vast Furniture & Homewares uses the highest quality suppliers & logistics teams, on rare occasions products may be damaged during packaging or lost and damaged during transit.\nIf your product is delivered and the carton or packaging is in good condition yet once unpacked the product is shown to be damaged, please contact hello@vastinterior.com.au or 07 3160 7555 and one of our team members will manage your case through to completion.\nLiability\nIt is the responsibility of the customer to ensure the correct delivery address and access details are provided to us at the time of sale. Vast Furniture & Homewares will not be responsible for any costs that arise due to the incorrect delivery address or access details provided by the customer. Vast Furniture & Homewares will not be liable for any refund of delivery fees paid by you the customer once the delivery service is completed.\nChange of mind:\nVast Furniture does not accept returned products due to a change of mind. This includes if you simply change your mind, decide you do not like the purchase or have no use for it.\nMinor problems: repair or exchange\nFor a minor failure (including damage during shipping) with the product, you are entitled to:\nHave the product repaired within a reasonable time frame by a Vast Furniture approved repair agent or a replacement of the product. If this is not completed within a reasonable time frame or the problem is not fixed you are then entitled to a refund or exchange.\nMajor problems: refund, repair or exchange\nFor a major failure with the product, you are entitled to:\nReject the product for a refund or reject the product for an identical replacement, or one similar in value if reasonably available or keep the product and obtain compensation from Vast Furniture for the drop in value of the product caused by the major failure.\nPricing\nPrices on the website indicates metro pricing, pricing may vary for some items in country stores"}, "https://www.hudsonfurniture.com.au/products/string-weave-timber-stool": {"String weave timber stool\n– Hudson Furniture": "MCHA287\nNEW String weave stool, made from Sungkai wood. Super comfy and lightweight. A perfect fit for any kitchen bench.\nDimensions & Need to Know:\nWidth 40cm Depth 37cm Height 66cm."}, "https://premiumpatio.com.au/products/outdoor-tables/page/3/": {}, "https://dhfonline.com/products/gift-card": {"Gift Card – Donna's Home Furnishings": "Gift Card\nShopping for someone else but not sure what to give them? Give them the gift of choice with a Donna's Home Furnishings gift card.\nGift cards are delivered to you, the purchaser, by email and contain instructions to redeem them at checkout. To send a gift card to someone, just forward them the email. Our gift cards have no additional processing fees."}, "https://furnish123watertown.com/products/": {}, "https://www.tandemarbor.com/products/kaiser-box-bed-blush-plush-velvet": {"Kaiser Box Bed - Blush Plush Velvet - Tandem Arbor": "Product Details:\nThis modern shelter bed possesses smooth edges and clean geometric lines that magnify its calculated simplicity. Enhanced with a double row of nailhead trim, and a fitted waterfall skirt, these details add a polished flair.\nProduction time is 8-12 weeks, plus 2-3 weeks for transit.\nDownload Tear Sheet\nView Upholstery & Construction Details\nPlease select an upholstery option for more information.\n- Each piece is custom made-to-order by expert craftsmen in North America using high quality, naturally and locally based materials.\n- Frames are bench-made from cross-directional engineered hardwood.\n- All upholstery is hand-sewn onto the frame to ensure a perfect fit.\nWhy We Love This\nLorem ipsum dolor sit amet, consectetur adipiscing elit. In consequat finibus est non rhoncus. Fusce commodo dui ut pharetra porta. Lorem ipsum dolor sit amet, consectetur adipiscing elit. In consequat finibus est non rhoncus. Fusce commodo dui ut pharetra porta."}, "https://www.perchfurniture.com/products/hoyt-chair": {"Hoyt Modern Armchair – Perch Furniture": "Hoyt Chair\nHoyt Chair\nRegular price $1,450.00\nDescription\nDesigned with simplicity in mind, the Hoyt Chair is anything but basic. Keep conversations flowing by placing a pair of these chairs in a room. The square silhouette and smart lines look even better when two chairs sit together. Plush cushions, and padded bolsters (which are stitched in place to keep the arms looking crisp and comfortable) make this chair the perfect place to chat or just relax.\nSpecifications\nWe worry about the details of your furniture so you don't have to.\n- Frame: Kiln-dried hardwood frame (never particle board or pine).\n- Joints: Corner-blocked, high-pressure stapled, and glued (screwed and doweled frames also available).\n- Suspension: Unidirectional webbing (interwoven strips of nylon webbing that create a very stable platform for cushions).\n- Cushions: Medium HR polyurethane foam. No flame retardants.\n- Glue: Low-VOC\n- 38\" L x 36\" D x 34\" H\n- Makes a great swivel chair. Call or email for details.\nDon't see the right color? We have 100s of fabrics and leathers available at the Perch shop, including that perfect grey.\nOverall Dimensions\nWidth: 38\"\nDepth: 36\"\nHeight: 34\"\nCustomize it!\nNeed more options? We can customize this item to your exact specification. Learn more.\nStill Unsure?\nWe’ll send you some fabric samples right to your door.Request Swatches"}, "http://www.vawayside.net/store/products/tag/beds": {}, "https://curiousgrace.com.au/products/cleo-desk-lamp": {}, "https://modshop1.com/collections/amalfi/products/amalfi-3-door-credenza": {}, "https://www.scandesign.com/products/pavia-sectional-ivory": {}, "https://www.sofamania.com/products/carl-victorian-inspired-velvet-button-detail-vanity-accent-stool": {}, "https://www.fentonandfenton.com.au/products/gift-card&media=http://cdn.shopify.com/s/files/1/1909/9637/products/GiftVouchers_Product_1024x1024.jpg&description=Gift%20Card%20%23Art-Lover%20%23Birthday%20%23Colour-Lover": {"Fenton & Fenton": "Skip to content\nThis website uses JavaScript to apply discounts. To be eligible for discounts, please enable JavaScript for your browser."}, "https://4-chairs.com/products/mason-chair": {"Mason Chair\n  \n  \n  \n  – Four Chairs Furniture and Design": "The beautiful Mason Chair can work in any setting; from contemporary to casual and even formal. Made in a beautiful black leather and natural wood leather. These chairs are perfect for surrounding your dining table.\nDetails\nDimensions\nShipping\nBlack Leather\nWood\nP-23032\n22'' Wide x 24'' Deep x 34'' High\nSeat Height: 18.5\"\nArm Height: 26.5\"\n6-8 weeks\nReturnable for store credit within 14 days of delivery date. For more information, please see our return policy.\nIf you have questions about your order, please email orders@4-chairs.com"}, "https://www.theinside.com/products/x-bench-onyx-austin-stripe-by-old-world-weavers/PTM_XBench_OnyxAustinStripeByOldWorldWeavers": {}, "https://stationfurniture.store/products/milano": {}, "https://pinchdesign.com/products/yves-desk": {"View the Yves desk | Refined elegance by PINCH — Pinch Design": "+44 (0) 207 622 5075\nIncludes VAT. Excludes shipping or overseas crating.\nThe Yves desk is an elegant and compact writing desk, with softly sculpted legs and a tiered top. It has an inlaid dark brown leather writing surface, two drawers and a cable access hole to each side at the rear of the desk.\nPlease select the timber from the drop-downs to update the price. This item requires basic assembly or can be delivered white glove including assembly.\nThis item is typically in stock and ready to ship. Please place an enquiry with our sales team to purchase.\nThis piece is made in Europe"}, "https://www.do-shop.com/products/gift-card": {"Gift Voucher - Do Shop": "Gift Voucher\nby Do Shop\n£10.00\n( / )Unavailable\nPlease select all options.\nShopping for someone else but not sure what to give them? Give them the gift of choice with a Do Gift Voucher.\nGift vouchers are delivered by email and contain instructions to redeem them at checkout. Our gift vouchers have no additional processing fees and can be used over multiple transactions."}, "https://claytongrayhome.com/products/palecek-coco-ruffle-mirror": {"Palecek Coco Ruffle Mirror\n – CLAYTON GRAY HOME": "Coco Ruffle Mirror\nCoco Ruffle Mirror\nMaterials\nCoco Wood and Beads; Beveled Mirror\nDimensions\n37\" Diameter x 7\" Deep\nDetails\nPalecek presents the Coco Ruffle Mirror which captures a fresh coastal style for your home. A beveled mirror with a ruffle shaped metal frame embellished with coco wood and beads is finished in a natural finish. Display the Coco in hallways, bathrooms or living spaces for a breathtaking wall accessory. *Mirror includes a metal triangular hanger for mounting.\nPlease note: lead time changes daily and will be confirmed upon ordering. Please feel free to inquire below for current stock if needed.\nShipping & Returns\nIn stock and ready to ship. Order now and enjoy Free shipping.Contact us here.\nReturns must be made within 14 days. See details.\n- Choosing a selection results in a full page refresh.\n- Opens in a new window."}, "https://dfohome.com/products/patio-furniture/swings/all-swings": {"Shop our entire collection of porch swings | DFOhome": "*Only one coupon per order\nRelaxation is just another way of saying porch swing. The porch swing serves as an extension of all the welcoming warmth of a beautiful outdoor space. Here at DFOhome, we have a wealth of options to choose from when deciding just which swing to purchase. Whether you want a one person hammock swing or a more conventional double swing for your patio, we have what you need.\nNo matter what you choose, once you get your new porch swing, you will be well on your way to relaxation. Ideal accessories include a day off, a warm breeze, and a good book (sold separately). Don't forget to grab some comfy outdoor pillows, too! Shop porch swings now to get free shipping on all your orders!"}, "https://acmeshelving.com/collections/signs/products/sale": {}, "https://www.kmpfurniture.com/fire_collection/products/beds_80.html": {"Modern platform beds |  beds | japanese  platform beds - Fire Collection": "What Sets us apart\nfrom other bedroom companies is:\nOur beds are excellent for large homes, apartments and even small studios. Just choose the platform bed that best fits your needs\n- Excellent bed finishes and quality, along with sturdy, solid construction.\n- Contour bed designs with unique functions.\n- Enjoy a 30 day return policy, money back guaranteed!\n- These are the best prices along with the quality of the beds!\n- We have the platform beds you are looking for.\nWe offer high quality of bedroom furniture\nthat looks great!\nBed Sizes:\nQueen bed size 60\" Width x 80\" Length\nKing bed size 76\" Width x 80\" Length"}, "https://www.jseitz.com/products/buddha": {}, "https://www.furnitureworldgalleries.com/products/": {"Products - Furniture World Galleries": "[show_product_catalog]\nInteger vehicula tristique efficitur. Phasellus suscipit porttitor fringilla. Vivamus eu placerat elit. Quisque sem.\n1200 Quisque imperdiet ante.\ninfo@sitename.com\n123 654 7859"}, "https://www.homekoncepts.com/products/furniture/tables/end-tables/": {}, "https://cityfurnitureshop.com/collections/greenington/products/azara-bed": {}, "https://www.theguestroomfurniture.com/products/": {"Quality Home Furniture – Bedroom, Living Room, Dining Room – Made In The USA —  The Guest Room Furniture": "The Guest Room offers a wide array of top quality, trusted brands that are handcrafted in North America. We also offer a variety of decorative accessories and art work to complete the look of your room. Designers welcome!\nThe Guest Room offers a wide array of top quality, trusted brands that are handcrafted in North America. We also offer a variety of decorative accessories and art work to complete the look of your room. Designers welcome!\n312 E. Market St Suite D\nLeesburg, VA 20176\n(703) 771 9484", "Bathroom Furniture – Cabinets, Vanities, Home Furnishings —  The Guest Room Furniture": "The Guest Room Furniture\nTuesday – Saturday: 10 to 5\n312 E. Market St Suite D\nLeesburg, VA 20176\n(703) 771-9484\nSorry, no content matched your criteria.\n312 E. Market St Suite D\nLeesburg, VA 20176\n(703) 771 9484", "Bedroom Furniture Store – Bed, Dresser, Wardrobe, Home Furnishings —  The Guest Room Furniture": "Visit the Bramble website. Created by the hands of artisans, craftsmen and women that have been in the industry for decades, the products at Bramble Furniture are made with intricate techniques and delicate designs that have been perfected over the years they’ve been a family business.\nDurham\nVisit the Durham website. At Durham Furniture, solid wood furniture is distinguished by exceptional quality, award-winning design and enduring value. Durham furniture is handcrafted from sustainably harvested cherry and maple\nEastern Accents\nVisit the Eastern Accents website. Eastern Accents designs and manufactures luxury bedding and home accessories for the trade. They specialize in several styles of traditional and contemporary bedding, as well as Italian fine bedding linens, luxury throw pillows, sassy phrase pillows, and holiday décor.\nGat Creek\nVisit the Gat Creek website. Gat Creek furniture is built specifically for you. They don’t import, and they don’t run an assembly line. Each piece is hand-made from solid Appalachian hardwoods and personally signed by the person who builds it.\nMacKenzie-Dow\nVisit the MacKenzie Dow website. When you purchase a fine quality design from MacKenzie-Dow, you’ll experience a surprisingly timeless blend of Old World heritage and modern-day practicality.\nRiverside\nVisit the Riverside website. Riverside Furniture Corporation is truly an American success story. From a modest beginning in 1946, making furniture in a single plant, Riverside has grown to become a major brand name in the furniture industry. Over 70 years later, they are warehousing product in multiple locations world-wide and selling through over 3,500 […]\nSimply Amish\nVisit the Simply Amish website. At Simply Amish furniture, the term Amish isn’t a style. It’s the standard of excellence by which all solid wood Amish furniture is handcrafted — this standard is desired by many and practiced by a very rare few.\nTheodore Alexander\nVisit the Theodore Alexander website. Theodore Alexander is one of the leading manufacturers of fine furniture. Our comprehensive collections consist of several thousand designs, providing eclectic, traditional and modern classical furniture and accessories to our clients. Theodore Alexander has become eminent in its field – renowned as a unique brand embodying quality in design. To […]", "Clearance —  The Guest Room Furniture": "MSRP: $555 CLEARANCE: $278\nSUMMER CLASSICS MONACO SPRING LOUNGE (4 in stock)\nMSRP: $2084 CLEARANCE: $834.00\nCHARLESTON FORGE PADDOCK CONSOLE\nMSRP: $4110 CLEARANCE: $1644\nFURNITURE CLASSICS CANE BACK ARM CHAIR (2)\nMSRP: $1755 CLEARANCE: $878 EACH\nDURHAM 70″ ET CENTER\nMSRP: $5055 CLEARANCE: $2528\nWesley Hall Leather Tiltback Chair & Ottoman\nMSRP: $6929 CLEARANCE: $3465\nGabby Settee\nMSRP:$5193 CLEARANCE: $2596\nSummer Classic Charleston Swivel-2 in stock\nMSRP: $3464 Clearance: $1386\nSummer Classic Rustic Sofa 2 in stock\nMSRP: $5394 Clearance: $2158\nCRLaine Studio Settee\nMSRP: $4839 Clearance: $1936\nWoodbridge Bar Stool\nMSRP: $1185 Clearance: $599 (4 available)\nGat Creek Monterey Side Chair\nMSRP: $831 Clearance: $332 (4 available)\nGat Creek Thea Side Chairs\nMSRP: $921 Clearance: $368 (4 available)\nPark Hill Cabinet\nMSRP: $6758 Clearance: $3379\nFairfield Trident Swivel Chair\nMSRP: $2878 Clearance: $1150\nNorwalk Edinburgh Chair\nMRSP: $4384 Clearance: $1754\nNorwalk Power Recliner\nMSRP: $5104 CLEARANCE: $2039\nFile Cabinet with Hutch\nFile Cabinet with Hutch MSR $3798 Clearance $1531\nSwivel Chair\nSwivel Chair MSRP $2841 Clearance $892\nAccent Cubes\nAccent Cubes MSRP $859 ea Clearance $258.00 each\nCoffee Table\nCoffee table SRP $2385 Clearance $716.00", "Decorative Accessories – Home Decor, Wall Art and More —  The Guest Room Furniture": "The Aidan Gray line represents a love for interiors, design and authentic products that exude “European Grandeur.”\nBedford Cottage\nBedford Cottage has been manufacturing decorative throws since 1982. Styles, textures, and colors have changed over the years, but their commitment to providing quality and timeless designs remains the same.\nCeledon Art\nCeladon Art searches the world for inspiration to create for the furniture, gift and design trade. From their award-winning design studio comes a broad selection of clean and minimal, comfortable and natural or classic European elegance. They offer creatively framed artwork following the newest trends every day.\nChelsea House\nFor decades, Chelsea House has brought warmth and beauty to homes with its extensive line of furniture, lighting, art, mirrors and decorative accessories.\nCurrey & Co.\nCurrey & Company is a wholesale manufacturer of distinctive home furnishings products. They are best known for their lighting products (chandeliers, wall sconces, table and floor lamps) as well as interior furniture, garden furniture and accessories.\nCyan Design\nCyan Design is the source for unique decorative objects. Decorative accessories for the most vibrant interior design.\nE. Lawrence\nE. Lawrence, Ltd. is an Atlanta-based purveyor of leather-bound books and handmade parchment bound books. Started in 1998, they quickly grew to be the largest importer/supplier of decorative leather-bound books in the country. They soon added a parchment bound division that is crafted by hand and flush with creative designs that has made their mission […]\nIconic Pineapple\nIconic Pineapple creates and publishes innovative wall decor, all right here in the USA. They offer one of the most complete and expansive product lines in the industry, with a large percentage of artwork being exclusive and not available anywhere else.\nInternational Table Pads\nOhio Table Pad Company is a manufacturer of custom made table pad protection for fine dining room tables and other wood furniture surfaces.\nJamie Young Co.\nJamie Young Co. provides casual elegance for every home through exceptional lighting and decor. Their globally-inspired pieces are eclectic yet elegant, unique yet relatable, and non-traditional yet easy to fit with any home.\nNapa Home\nNapa Home & Garden is a home decor wholesaler selling to the trade, with headquarters in the greater Atlanta area and a distribution center in Newport News, VA. They provide sophisticated products for the home, selling to style-conscious retailers via a best-in-class shopping experience.\nNatural Decorations, Inc.\nFor over 45 years, NDI has been the premier provider of the finest floral and botanical reproductions in the world! NDI has taken the art of fabric floral and botanical design to a new level and their quality is unsurpassed.\nNest Fragrances\nWe believe fragrances should be impactful. Make an environment brighter. An expression bolder. A moment more exceptional. The mood created by an extraordinary fragrance asserts itself and has the ability to transport people and transform spaces.\nPine Cone Hill\nFor more than 20 years, Pine Cone Hill has applied a spirited, design-driven approach to creating bedding, rugs, sleepwear, and accessories that stand out—and stand the test of time.\nShadow Catchers\nShadow Catchers began several years ago with the idea that art should be accessible to all people within a variety of categories, size ranges and price ranges.\nSurya\nAt Surya, their goals are simple: to be the go-to resource for coordinating home accessories across a diverse range of lifestyles and budgets and to simplify the shopping process for designers, retailers and end consumers. Experts at merging form with function, Surya translates the most relevant apparel and home decor trends into fashion-forward products across […]\nUttermost\nAccent furniture, mirrors, wall decor, wall art, clocks, lamps, lighting fixtures, home accessories and more available today at Uttermost.", "Dining Room Furniture – Dining Table, Chairs, Dining Sets & Kitchen Dining —  The Guest Room Furniture": "Visit the Bramble website. Created by the hands of artisans, craftsmen and women that have been in the industry for decades, the products at Bramble Furniture are made with intricate techniques and delicate designs that have been perfected over the years they’ve been a family business.\nCharleston Forge\nVisit the Charleston Forge website. Making beautiful furniture in America is their passion. Whether they are forging hot metal or hand-scraping a solid wood table top, you can see and feel a sense of hand in every piece they make.\nFairfield\nVisit the Fairfield website. For nearly a century, we’ve combined masterful craftsmanship with fashion-forward design of fine furnishings for the home, office, and hospitality industries. We’re a family of craftspeople who care about our community, the environment, and you.\nFurniture Classics\nVisit the Furniture Classics website. Furniture Classics Limited is dedicated to producing value oriented, solid wood, antique reproduction furniture. Three generations of a family rich in furniture heritage constantly work to develop well priced, dependable constructions of authentic reproductions and classic style.\nGat Creek\nVisit the Gat Creek website. Gat Creek furniture is built specifically for you. They don’t import, and they don’t run an assembly line. Each piece is hand-made from solid Appalachian hardwoods and personally signed by the person who builds it.\nMacKenzie-Dow\nVisit the MacKenzie Dow website. When you purchase a fine quality design from MacKenzie-Dow, you’ll experience a surprisingly timeless blend of Old World heritage and modern-day practicality.\nRiverside\nVisit the Riverside website. Riverside Furniture Corporation is truly an American success story. From a modest beginning in 1946, making furniture in a single plant, Riverside has grown to become a major brand name in the furniture industry. Over 70 years later, they are warehousing product in multiple locations world-wide and selling through over 3,500 […]\nSimply Amish\nVisit the Simply Amish website. At Simply Amish furniture, the term Amish isn’t a style. It’s the standard of excellence by which all solid wood Amish furniture is handcrafted — this standard is desired by many and practiced by a very rare few.\nTheodore Alexander\nVisit the Theodore Alexander website. Theodore Alexander is one of the leading manufacturers of fine furniture. Our comprehensive collections consist of several thousand designs, providing eclectic, traditional and modern classical furniture and accessories to our clients. Theodore Alexander has become eminent in its field – renowned as a unique brand embodying quality in design. To […]\nWoodbridge Furniture\nVisit the Woodbridge Furniture website. Woodbridge Furniture is a high-end brand in the home furnishings marketplace offering case goods, dining and occasional furniture. Woodbridge from its inception has focused on high quality veneers and finishes combined with best in class construction.", "Entertainment Furniture – Entertainment Center, TV Stand, Bookshelves —  The Guest Room Furniture": "Visit the Durham website. At Durham Furniture, solid wood furniture is distinguished by exceptional quality, award-winning design and enduring value. Durham furniture is handcrafted from sustainably harvested cherry and maple\nGat Creek\nVisit the Gat Creek website. Gat Creek furniture is built specifically for you. They don’t import, and they don’t run an assembly line. Each piece is hand-made from solid Appalachian hardwoods and personally signed by the person who builds it.\nMacKenzie-Dow\nVisit the MacKenzie Dow website. When you purchase a fine quality design from MacKenzie-Dow, you’ll experience a surprisingly timeless blend of Old World heritage and modern-day practicality.\nRiverside\nVisit the Riverside website. Riverside Furniture Corporation is truly an American success story. From a modest beginning in 1946, making furniture in a single plant, Riverside has grown to become a major brand name in the furniture industry. Over 70 years later, they are warehousing product in multiple locations world-wide and selling through over 3,500 […]\nSimply Amish\nVisit the Simply Amish website. At Simply Amish furniture, the term Amish isn’t a style. It’s the standard of excellence by which all solid wood Amish furniture is handcrafted — this standard is desired by many and practiced by a very rare few.\nSligh\nVisit the Sligh website. Sligh brings you the most beautiful and innovative office and entertainment designs. With a legacy dating back to 1880, Sligh is at the forefront of product development in residential, commercial, and hospitality, designing features and functions that enhance the office and entertainment experience.", "Fabric – Upholstery, Curtains, Pillows, Throws —  The Guest Room Furniture": "Visit the Fabricut website. Fabricut is one of the largest, most progressive distributors of decorative fabrics in the world; the brand designers depend on for everyday decorating.\nGreenhouse\nVisit the Greenhouse website. Arnold Bjork founded their family fabric business on the tenets of being trustworthy, honoring their word, and treating employees and customers like family. They espouse those same values today. Their clients see those principles in everything they do, from providing unique, high-quality fabrics to delivering unparalleled customer service. Their goal is […]\nKasmir\nVisit the Kasmir website. Extraordinary products, a commitment to customers, and a flair for design. The fabric of Kasmir Fabrics + Furnishings is woven with success and service. For almost half a century Kasmir has been a trusted international resource to the interior design community. In showrooms across the country, and from their 200,000-square-foot state-of-the-art […]\nKravet\nVisit the Kravet website. Kravet is an industry leader in to-the-trade fabric selection, offering the widest range of colors, patterns and textures for every design style.\nLee Jofa\nVisit the Lee Jofa website. Lee Jofa has been a leading source of fine fabrics for the discriminating interior designer for almost two centuries and has mastered the delicate harmony between the past, present and future.\nOsbourne & Little\nVisit the Osbourne & Little website. Osborne & Little offers a collection of the finest fabric and wallpaper designs, exquisitely designed upholstery, furniture, wallcoverings, trimmings, fabrics and outdoor fabrics from Nina Campbell, Liberty Furnishings, Lorca and Michael Reeves.\nSchumacher\nVisit the Schumacher website. Family-owned company since 1889, Schumacher is a style leader and design innovator, specializing in luxury fabrics, wallcoverings, trims, pillows, furniture and antiques.\nStout\nVisit the Stout website. Stout continues to adapt to the ever-evolving landscape of interior design by coming out with new and beautiful products every season. The 3rd and 4th generations are very much involved with business and continue to build on the legacy that was started 92 years ago as one of the industry’s oldest […]\nThibaut\nVisit the Thibaut website. Thibaut (pronounced Tee-Bo) Wallpaper and Fabric Since 1886. Known for a fresh, inspiring color palette with classic style, Thibaut offers unsurpassed quality and design in styles ranging from historic reproductions, toile, and chinoiserie to tropical and novelty patterns. With an insightful knowledge of trends and what homeowners want, Thibaut consistently delivers uniquely […]", "Living Room Furniture – Tables, Sofas, Chairs, Couches, Chaises, Sectionals —  The Guest Room Furniture": "Visit the C.R. Laine website. C.R. Laine creates inspiring upholstered furniture through innovative STYLE. COMFORT. and COLOR. They produce the best in customized, bench–crafted upholstery including exposed wood, leather, and upholstered chairs, sofas, chair-and-a-half’s & sectionals.\nFairfield\nVisit the Fairfield website. For nearly a century, we’ve combined masterful craftsmanship with fashion-forward design of fine furnishings for the home, office, and hospitality industries. We’re a family of craftspeople who care about our community, the environment, and you.\nFour Seasons\nVisit the Four Seasons website. Four Seasons gives you the freedom to choose exactly what you want. Their Collections are specially crafted with you in mind with an emphasis on slipcovers.\nNorwalk Furniture\nVisit the Norwalk Furniture website. Norwalk Furniture offers great designs, over 850 fabrics and leathers, customizable options, high quality products, and quick delivery. All Norwalk upholstery styles are Made in the USA.\nThibaut\nVisit the Thibaut website. Thibaut (pronounced Tee-Bo) Wallpaper and Fabric Since 1886. Known for a fresh, inspiring color palette with classic style, Thibaut offers unsurpassed quality and design in styles ranging from historic reproductions, toile, and chinoiserie to tropical and novelty patterns. With an insightful knowledge of trends and what homeowners want, Thibaut consistently delivers uniquely […]\nWesley Hall\nVisit the Wesley Hall website. Over the last 20 years, Wesley Hall has become a key manufacturer in the upper segment of the upholstered furniture market. They attribute their success to an unwavering commitment to providing excellent service, quality, fashion, and value.", "Occasional & Accent Tables – Coffee Table, End Table, Side Table —  The Guest Room Furniture": "The Aidan Gray line represents a love for interiors, design and authentic products that exude “European Grandeur.”\nCharleston Forge\nVisit the Charleston Forge website. Making beautiful furniture in America is their passion. Whether they are forging hot metal or hand-scraping a solid wood table top, you can see and feel a sense of hand in every piece they make.\nChelsea House\nFor decades, Chelsea House has brought warmth and beauty to homes with its extensive line of furniture, lighting, art, mirrors and decorative accessories.\nCurrey & Co.\nCurrey & Company is a wholesale manufacturer of distinctive home furnishings products. They are best known for their lighting products (chandeliers, wall sconces, table and floor lamps) as well as interior furniture, garden furniture and accessories.\nFairfield\nVisit the Fairfield website. For nearly a century, we’ve combined masterful craftsmanship with fashion-forward design of fine furnishings for the home, office, and hospitality industries. We’re a family of craftspeople who care about our community, the environment, and you.\nFurniture Classics\nVisit the Furniture Classics website. Furniture Classics Limited is dedicated to producing value oriented, solid wood, antique reproduction furniture. Three generations of a family rich in furniture heritage constantly work to develop well priced, dependable constructions of authentic reproductions and classic style.\nGat Creek\nVisit the Gat Creek website. Gat Creek furniture is built specifically for you. They don’t import, and they don’t run an assembly line. Each piece is hand-made from solid Appalachian hardwoods and personally signed by the person who builds it.\nMacKenzie-Dow\nVisit the MacKenzie Dow website. When you purchase a fine quality design from MacKenzie-Dow, you’ll experience a surprisingly timeless blend of Old World heritage and modern-day practicality.\nSimply Amish\nVisit the Simply Amish website. At Simply Amish furniture, the term Amish isn’t a style. It’s the standard of excellence by which all solid wood Amish furniture is handcrafted — this standard is desired by many and practiced by a very rare few.\nWoodbridge Furniture\nVisit the Woodbridge Furniture website. Woodbridge Furniture is a high-end brand in the home furnishings marketplace offering case goods, dining and occasional furniture. Woodbridge from its inception has focused on high quality veneers and finishes combined with best in class construction.", "Office Furniture – Computer Desk, Office Chair, Filing Cabinet —  The Guest Room Furniture": "Visit the Gat Creek website. Gat Creek furniture is built specifically for you. They don’t import, and they don’t run an assembly line. Each piece is hand-made from solid Appalachian hardwoods and personally signed by the person who builds it.\nMacKenzie-Dow\nVisit the MacKenzie Dow website. When you purchase a fine quality design from MacKenzie-Dow, you’ll experience a surprisingly timeless blend of Old World heritage and modern-day practicality.\nSimply Amish\nVisit the Simply Amish website. At Simply Amish furniture, the term Amish isn’t a style. It’s the standard of excellence by which all solid wood Amish furniture is handcrafted — this standard is desired by many and practiced by a very rare few.\nSligh\nVisit the Sligh website. Sligh brings you the most beautiful and innovative office and entertainment designs. With a legacy dating back to 1880, Sligh is at the forefront of product development in residential, commercial, and hospitality, designing features and functions that enhance the office and entertainment experience.\nTheodore Alexander\nVisit the Theodore Alexander website. Theodore Alexander is one of the leading manufacturers of fine furniture. Our comprehensive collections consist of several thousand designs, providing eclectic, traditional and modern classical furniture and accessories to our clients. Theodore Alexander has become eminent in its field – renowned as a unique brand embodying quality in design. To […]", "Outdoor Furniture for the Patio, Garden & Pool —  The Guest Room Furniture": "Visit the Kingsley-Bate website. British craftsmen of the 18th-century discovered what their Eastern counterparts had known for centuries, that teak has qualities unlike any other wood.\nSummer Classics\nVisit the Summer Classics website. Summer Classics furnishings stand out. They are exciting and unexpected, unique and timeless. They are also fashionable yet timeless.", "Rugs – Area Rugs, Oriental Rugs, Outdoor Rugs & Interior Design —  The Guest Room Furniture": "From classic American design to chic downtown appeal, Capel Rugs offer impeccably detailed floor coverings constructed for years of use.\nDash & Albert\nA spirited, design-driven family of companies that creates enthusiasm through timely and timeless lifestyle products and a caring commitment to people and process, Dash & Albert’s mission drives their business and profitability feeds their mission.\nFeizy Rugs\nFeizy brings show-stopping and award-winning products from Old World to New World, and everywhere in between. Their meticulously designed and handpicked rugs live both as timeless home fashion and long-treasured family heirlooms\nJaipur\nHeadquartered in Atlanta, Jaipur’s offerings include flatweaves, naturals, transitional and modern collections. Design is a passion for Jaipur from its very core and spills out in bold colors, distinctive styles and fashion-forward trending.\nSurya\nAt Surya, their goals are simple: to be the go-to resource for coordinating home accessories across a diverse range of lifestyles and budgets and to simplify the shopping process for designers, retailers and end consumers. Experts at merging form with function, Surya translates the most relevant apparel and home decor trends into fashion-forward products across […]"}, "https://www.danishinspirations.com/products/products/bedroom/page/3/": {"Modern and Contemporary Bedroom Furniture, Houston, Texas": "Contact us\nPhone: 713.782.4911\nNeed help or have a question?\nContact us at: info@danishinspirations.com\n2775 Fondren Rd\nHouston, TX 77063\nPhone: 713.782.4911\nNeed help or have a question?\nContact us at: info@danishinspirations.com\n2775 Fondren Rd\nHouston, TX 77063\nShowing 33–48 of 88 results\nDelivering Quality Furniture and Exceptional Service to Houston for Over 40 Years - Since 1982."}, "https://columbineshowroom.com/products/": {"Products - Columbine Showroom - Denver, CO": "Bernhardt\nBradington Young\nBrown Jordan\nCaracole\nFour Hands\nHekman\nHooker Furniture\nHoward Elliott\nLEE Industries\nLloyd Flanders\nO.W. Lee Outdoor\nRC Furniture\nSam Moore\nSaloom\nStylus\nSummer Classics\nTaylor King\nThe Uttermost Company\nTheodore Alexander\nTreasure Garden Umbrellas\nTropitone\nV\nVilla & House\nX\nX-Chair"}, "https://emfurn.com/products/aaron-sofa": {"Aaron Mid Century Modern Upholstered Sofa\n – EMFURN": "Aaron Retro Sofa\nDescription\n-\nFurther your sensibilities with Aaron. Elegantly inset with a centered line of tufted buttons and fine polyester upholstery, Aaron enhances an ambiance of exceptionalism with a refined design that spans the ages. Aaron features dense foam cushioning, walnut stained wood legs with non-marking foot caps, and a supportive seating experience. This modern take on mid-century design is perfect for living rooms, lounge spaces, and reception areas.\n-\nGray\nAzure\nLaguna\nLight Gray\n-\nOVERALL PRODUCT DIMENSIONS: 82.5\"L x 33.5\"W x 28\"H\nSEAT DIMENSIONS: 71\"L x 22.5 - 71\"W x 18.5\"H\nARMREST HEIGHT: 28\"H\nBACKREST DIMENSIONS: 6\"W x 9.5\"H\nARMREST DIMENSIONS: 6\"W x 9.5\"H\nBASE DIMENSIONS: 81\"L x 32\"W\nQUESTIONS & ANSWERS\nHave a Question?\nBe the first to ask a question about this."}, "https://fmvegas.com/products/carlo-dresser": {}, "https://nicoyafurniture.com.au/products/playa-bowl": {}, "https://galvinbrothers.co.uk/products/alfandbud": {"Alf & Bud Side Tables\n—\n        Galvin Brothers": "Alf (tall) and Bud (short) are a friendly pair of side tables, different in size and shape but sharing in characteristic material and form. Silhouette hand turned pedestals in solid ebonised oak with natural oak finished tops.\nMade to order: 10-12 weeks This items is made to order in our standard lead-time, if you need an expedient service please get in touch: 01482 679862\nShipping guide: UK for £32\nDimensions: Alf: ø400 x 570h mm\nBud: ø500 x 420h mm\nCustomise: This piece is made to order which allows us to give some ﬂexibilty to you if you need to specify alternative dimensions or a different timber/ finish. We work closely with the trade to develop bespoke and exclusive commissions for larger schemes."}, "https://tyfinefurniture.com/products/enso-platform-bed": {"Enso Solid Wood Platform Bed | Modern & Handmade Platform Bed | Made in USA\n– T.Y. Fine Furniture": "Enso Platform Bed Frame and Headboard - Solid Wood Modern Bed Frame\nDescription\nThe Enso Platform Bed invites peaceful slumber with a sophisticated, Zen-inspired aesthetic. Smooth, clean lines and gentle curves form this modern platform bed, encouraging quiet serenity.\nThis piece bears some semblance to our Sunrise Platform Bed. But the top of the headboard curves into a very subtle concave, as inspired by the roofs in traditional Japanese architecture.\nThe higher headboard enhances support for reading, laptop surfing, or working in bed. Moreover, it’s made of natural hardwood, as is the rest of the platform bed, so sturdy support is guaranteed.\nA solid wood frame of this caliber is truly one of a kind. It’s made of natural hardwood, which is harvested in Ohio’s managed forests. Plus, it’s finished with our propriety organic finish, produced from all-natural ingredients with zero VOC emissions. This makes the Enso Platform Bed and the rest of T.Y. Furniture’s handcrafted pieces a good organic furniture option.\nThis modern platform bed is proudly handcrafted in Columbus, Ohio.\nMattresses\nThis modern platform bed is built to accommodate all mattress types. From all latex to coil and even memory foam, this frame will protect your mattress.\nIf you have not purchased a mattress yet, contact us about our Organic Mattress lines; you will be glad you did!\nWood Options\nWe never stain our wood. It is all 100% natural solid wood in cherry, walnut, oak, and maple. Each wood option is the actual wood species your item will be built using. This gives you a prettier wood grain and a better quality piece of furniture.\nFinish\nEvery piece is meticulously and sumptuously finished with our signature finishes formulated from non-toxic, all-natural ingredients with zero VOC emissions. This makes our pieces a great option for those looking for organic furniture.\nSizes\nAll Enso Beds Have a 12\" Tall Platform and a 44\" tall headboard with 10.25\" clearance under the bed. This bed frame is designed to accommodate mattresses 10-14” thick. If your mattress is different, we can customize a frame to fit your needs at no added cost.\nSize Mattress Size Footprint Twin 39 x 75 42 x 79 Full 55 x 75 58 x 79 Queen 60 x 80 66 x 84 King 76 x 80 82 x 84 Cal King 72 x 84 78 x 89\nShipping\nThis item ships in 4 smaller boxes, all securely strapped to a custom-made wood pallet. It ships from Columbus, Ohio.\nWood And Finish Options\nWe believe believe that wood should never be stained. Every item that we meticulously handcraft is made using 100% solid wood, in the species of wood that you select.\nA Walnut item will be Solid Walnut Wood, not muddy walnut colored chemical pigments applied over a cheaper material.\nOur Primary finish is our Proprietary Organic Blend of natural Oils and Waxes. We do not add any chemicals, thinners, pigments or metallic driers to our finish. In fact, our finish is actually made using 100% food grade ingredients!\nOn heavy use items, such as dining tables, we use a hard coating finish that has zero-VOC content and is certified for food contact.\nYou may at any point speak with us to select a different finish or to ask questions and get answers.\nShipping\nWe know buying furniture from TY Fine Furniture is a long term investment and that our customers want their items on time and in perfect condition.\nWe want the best experience for all our customers. Because of this, we have developed a shipping process that results in consistently excellent results.\nCurrently, all items are designed to be lightly disassembled for shipping. This means that there is some light assembly involved with most items. Most items it means attaching the legs, on beds its a little more complex, but still very simple.\nBy lightly disassembling every item, it also means that you can easily and quickly move the individually boxed parts into your room with ease, our target for each box is a maximum weight of 75 lbs. Every individual box is sized to go through smallest elevator and around tightest corners.\nOur average bed frame takes 30-45 minutes to assemble, our customers are always elated about how easy it is, and how sturdy and durable the resulting furniture becomes.\nlittle as 4 weeks!\nGUARANTEE\nPAYMENT\nPOLICY"}, "https://24estyle.com/products/eliza-fan": {"Eliza Fan": "24e Design Co.\nEliza Fan\nDesigned by Chicago architect Stephen Katz in 2013, the Eliza blends a beautiful technically derived form with superior function and movement. The unique blade shape is designed to maximize air movement at the outer edge of the blade. The result is more efficient air velocity rings, less blade drag and greater motor optimization. Equally important is the Eliza fan’s stationary visual statement which combines modern utility with minimalist geometry.\nDimensions 56\" D\nAdditional Details\n•Energy efficient, ultra-quiet, six-speed and reversible DC motor with new reliable technology.\n•Damp location finishes: brushed nickel and gloss white.\n•Blades available in Gloss White, Brushed Nickel, Walnut, Barnwood or Gray Ash.\n•Constructed of cast aluminum, polycarbonate and heavy stamped steel.\n- Regular price\n- $600.00\n- Sale price\n- $600.00\n- Regular price\n-"}, "https://shopspencerfurnituresiouxfalls.com/products/glass-lamp": {}, "https://bryantscountrystore.com/products/deli-sandwich-carryout": {}, "https://vincentdesign.com.au/products/spaltekanden-big-white": {}, "https://magnolialane.biz/products/anika-cushion": {}, "https://blupeter.com.au/products/tulip-object": {}, "https://www.cranmorehome.com.au/products/gift-card": {"GIFT CARD – Cranmore Home & Co.": "FREE SHIPPING for orders over $2500. (Metro only)\nGIFT CARD\n-\nRegular Price\n-\n$25.00\nSold Out\n-\nSale Price\n-\n$25.00\n-\nRegular Price\n-\n-\nUnit Price\n- per\n- Regular Price\n- $25.00\n- Sale Price\n- $25.00\n- Regular Price\n-\n- Unit Price\n- per\nSearching for something special but you can't quite make up your mind?\nGive the gift of choice with a Cranmore Home & Co. Gift Card.\nAll gift cards are valid for three years from purchase.\nIf you would like a different amount, please contact us and we can arrange this for you.\nOur gift cards are provided as electronic gift cards, if you would like one mailed to you please let us know.\nPlease note that the email address you enter whilst ordering is the email we will use for confirmation of the order and invoice. For us to send the gift card directly to your recipient with a personal note, please add the email address and personal note at check out in the \"note for order\" section.\nAny questions please contact us.\nLead Times May Apply - Stock Availability:\nAs we are an online only store we hold our homewares and smaller furniture items at our warehouse in Perth. The majority of our larger furniture items are delivered directly from our amazing brand partners. We work very closely with them to understand stock availability, but we also don’t like to disappoint our customers if it is out of stock or if there is a lead time as stock levels change frequently. Therefore if an item has a \"lead times may apply' message this means they may be in stock or have a lead time of 4 - 12 weeks, it just means we need to double check stock availability as they are super popular. Feel free however to place an order now as we also guarantee a full refund (within the week of purchase), if we contact you to advise the item is out of stock and/or lead times are longer than expected.\nPre-Orders:\nWe do however highly recommend placing a pre-order as items can sell out prior to shipments arriving, and this will ensure you receive your piece in the next shipment. If you would like estimated lead times, shipping quotes or any other information please try the instant chat or click on the Get In Touch button and we will get back to you as soon as possible. We can arrange a 50% deposit for all pre-order items, with balance due prior to delivery.\nLead Times:\nCranmore Home & Co quote an approximate lead time for the receipt of any orders based on information provided by their partner suppliers at time of purchase. Circumstances beyond our control, may cause disruptions and lead to a delay in your order being delivered on quoted lead times once an order is placed. We will keep you as up to date as possible on any changes to estimated lead times.\nDelivery:\nWhat we can promise is that we will ship all in-stock products from our Perth warehouse within 3 business days and in the case of bespoke or out-of-stock products, customers will be emailed as soon as possible with an estimated shipping date. As we are an online business and many of our larger items are delivered directly from our suppliers, in this case we endeavour to ensure that our suppliers dispatch in-stock items within 5-10 business days. Delivery all depends on where it is coming from and where you live. We generally allow 7-14 days most metro areas and for many country locations, WA, NT & Tasmania please allow 2-3 weeks. Some of our items are available for collection from our Perth warehouse and will have this information on the product page if available.\nNOTE: For pre-orders from suppliers with stock coming from international manufacturers please keep in mind, the current worldwide increase in demand and restrictions for international ocean freight container exports. This is affecting supply chains extensively and sometimes lead time extensions are out of our control.\nShipping:\nAll items have a flat fee based on weight, dimensions and delivery location. This cost ranges from $9.95 - $250 for metro areas throughout Australia and this will be applied at checkout if required. For regional areas throughout Australia or for some super heavy/bulky/fragile items you may incur an additional fee, this will be advised after checkout, prior to dispatch if required. If you would like a quote tailored for your order prior to check out please contact us . Some of our items are available for collection from our Perth warehouse and will have this information on the product page if available. Orders over $2500 are eligible for free shipping to metro cities (exc TAS & NT). For all orders over $2500 that fall within regional postcodes they will incur an additional delivery charge invoiced after order. Please contact us for a quote prior to order if you would like this confirmed.\nPLEASE NOTE: Delivery is to your post box or front door only. If you require white glove service of delivery, placement of item and removal of packaging please contact us to arrange. Additional costs will be incurred.\nStill can't find exactly what you are looking for? Well let us help you find it!\nYour perfect piece may not even be on our website, but that won't stop us, as our network of partner brands and products extends beyond the products we offer on our online store.\nWe can provide options and a quote with delivery costs, lead times all whilst providing a professional and personal service. Click HERE to let us know what it is you are looking for.\nNeed further information on any of the products or services?\n- Try our instant chat at the bottom right hand corner of your screen.\n- Submit a form below and we will get back to you as soon as possible.\n- Or email us at hello@cranmorehome.com.au.\nPrefer to have a chat though, feel free to call us on 1300 864 489. If you get our message service, please do leave a detailed message and we will get back to you as soon as possible. We have been experiencing a high level of unsolicited sales and scam calls so may not answer and will call you back if a message is left.\nNote: Cranmore Home & Co is an online only business and the office is not open to the public. We do however have a warehouse in Wembley, Perth which houses our smaller items and orders can be arranged to be collected from here."}, "https://www.vavoom.com.au/products/ebony-chest": {"Buy Tallboys & Dressers, Chest of Drawers Online | VAVOOM": "Gift Cards Available\n14 Day Returns\nPrice Match Promise\nAustralian Owned\n1300 577 079\nVisit Our Showroom\n15% OFF Our Bedroom Room Collection: This Week Only\n15% OFF Our Bedroom Room Collection: This Week Only\nLog In\nCreate Account\nAbout Us\nCollaborate with Vavoom\nGoogle Reviews\nBlogs\nWe recognise and pay our deepest respect to the Wurundjeri people of the Kulin Nation, the traditional custodians of the land on which our store resides.\nLog In\nShopping Cart\nCart (\n0\n)\nClose Cart\nChest of Drawers & Storage\nFilter\nRefine\nview all\nSort By\nPrice: Low to High\nPrice: High to Low\nNewest\nNewest Last\nBest Selling\nA-Z\nZ-A\nType\nSearch\nArmoires & Wardrobes\nCabinets & Storage\nColour\nSearch\nBlack\nNatural\nStyle\nSearch\nModern\nRetro\nCollection\nChest of Drawers & Storage\nclear\nNiche Large Chest of Drawers\nRegular price\n$1,423\n6ixty\nNiche Chest of 3 Drawers\nRegular price\n$840\n6ixty\n14%\nOFF\nSolid Baha Boutique Open Wardrobe 80X50X174CM\n$924\nSale price\n$789\nGallery Direct Australia\nSearch\nChoosing a selection results in a full page refresh.\nPress the space key then arrow keys to make a selection."}, "https://www.goodwoodfurniture.com.au/products/wardrobes/colonial-robe/": {"Colonial Robe | Wardrobes | Products | Good Wood Furniture, Bondi Junction, Sydney": "Thank you for all your help and great service. I love my new pine wardrobes, they fit perfectly and my bedroom ...\nMany thanks for supplying my made to measure solid pine bookcases. They add loads of character to my office and...\nI was very impressed with the service and the item I ordered from Good Wood Furniture in Bondi Junction, through Kate...\nI just love this store. I always find what I want, I have bought many pieces of furniture over the last 20 years ...\nThank you sooo much Katerina at Good Wood Furniture for the Great Service & also I'm sooo happ...\nAustralian Made Colonial Robe\nThis lovely piece will just add so much charm to any bedroom. Large drawers which run smoothly on metal runners and hanging space deep enough for adults hangers.\nIs available in bigger sizes and made to measure. Fully assembled and made to last.\nFeatures:\nMeasurements:\nHeight 1900mm x Width 960mm x Depth 530mm\nCustomize Your Product\n0415 450 293\n© 2021 Good Wood Furniture All Rights Reserved.\nDesigned & Developed by Eclick Softwares & Solutions Pvt. Ltd."}, "https://valentinesfurniture.com.au/products/": {"Valentines | New Custom Furniture | Furniture restoration": "Home\nAbout\nSubscribe\nBrands\nBlog\nContact\nMy Account\nLogin\n0 Items\nBetter Furniture. Better Life.\nSearch...\nFurniture\nAccent Chairs\nBarstools\nBookcases\nBuffets\nCoffee Tables\nConsoles\nHome office\nDesks\nChairs\nDining\nTables\nChairs\nSettings\nDisplay Cabinets\nEntertainment Units\nLamp Tables\nLift Chairs\nOttomans\nRecliners\nSofas\nChesterfields\nFabric\nLeather\nModulars\nSofa Beds\nHomewares\nArtwork\nClocks\nCushions\nDecorator\nFlowers\nLamps\nMirrors\nRugs\nThrow Rugs\nFurniture Care\nFabric\nLeather\nTimber\nServices\nPolishing\nRe upholstery\nCustom Design\nFinance\nSale\nHome\n» Products\nProducts\nAdele Buffet\nAdele Coffee Table\nAdele Lamp Table\nAdele TV Lowline\nAdele: 7 piece dining Setting\nAdele: Dining Chair\nAldgate\nALVA\nAMALPHI\nAmalphi 3.5 seater Power Leg & Headrest\nANDOVER\nANDOVER\nANGUS\n$\n159.00\nDETAILS\nADD TO CART\nANIKA\nAPOSTLE BLACK\n$\n295.00\nDETAILS\nADD TO CART\n1\n2\n3\n4\n…\n18\n19\n20\n›\nSearch Products\nSearch for:\nSearch\nProduct Categories\nNew Arrivals\nFurniture\nAccent Chairs\nBedroom\nBookcases\nBuffets\nCoffee Tables\nConsoles\nHome office\nDesks\nchairs\nDining\nTables\nChairs\nSettings\nDisplay Cabinets\nEntertainment Units\nLamp Tables\nLift Chairs\nOttomans\nRecliners\nSofas\nChesterfields\nFabric\nLeather\nModulars\nSofa Beds\nHomewares\nFurniture Care\nSale\nBrands\nIMG Recliners Chairs & Sofas\nMolmic Furniture\nMoran Furniture\nStressless Furniture\nLazyboy Furniture Australia\nScappini\nWarwick\nGarstone Furniture\nFURNITURE\nAccent Chairs\nBarstools\nBookcases\nBuffets\nChesterfields\nConsoles\nCoffee Tables\nHome Office\nDining\nDisplay Cabinets\nEntertainment Units\nLamp Tables\nModulars\nOttomans\nRecliners\nSofa Beds\nSofas\nHOMEWARES\nArtwork\nClocks\nCushions\nDecorator\nFlowers\nLamps\nMirrors\nRugs\nThrow Rugs\nFURNITURE CARE\nFabric\nLeather\nTimber\nAbout Us\nAbout\nContact\nMy Account\nBrands\nIMG Recliners Chairs & Sofas\nMolmic Furniture\nMoran Furniture\nStressless Furniture\nLazyboy Furniture Australia\nScappini\nWarwick\nServices\nPolishing\nRe-Upholstery\nCustom Design\nInterest Free Furniture Finance\ncontact\nValentines Furniture - Leather, Classic & City Living 56 Beischer Street, Bendigo, VIC 3550 Ph: 03 5441 6983 Fax: 03 5441 4662\nfacebook\ntwitter\nyoutube\npinterest\ninstagram\ngoogleplus\nhouzz\n© 2018 Valentines Furniture. All rights reserved."}, "https://www.loungesplus.com.au/products/baird-fabric-lounge-package": {}, "https://www.yellowleafhammocks.com/products/hammock-gift-card": {"Give a Hammock Gift Card: All Yellow Leaf Hammocks & Hanging Chairs": "Give a Gift Card: Any Size!\nShopping for someone else but not sure what to give them? Give them the gift of choice with a Yellow Leaf Hammocks Gift Card! You pick a size + they pick the color they love most!\nGift cards are delivered by email and contain instructions to redeem them at checkout.\nOur gift cards have no additional processing fees and include free shipping for your recipient.\nHammocks Loved By:\nYou’ve got questions, we’ve got answers.\n- How long does shipping take?\n- How do I hang my hammock?\n- What’s your return policy?\n- I have even more questions!\n-\nBest for the backyard\nSignature Hammock\n+ 10 more colors\n-\nBest for the great indoors\nCotton Rope Hammock\n-\nBest For Some “Me Time”\nThe Chair Hammock\n+ 5 more colors"}, "https://asplundstore.se/products/fish-bricka": {"Fish bricka vit | ASPLUND Store\n– ASPLUND Store Onlineshop": "Fish bricka med det ikoniska mönstret med samma namn som är ritat av Thomas Sandell exklusivt för ASPLUND 2010. En perfekt present till någon som önskar sig klassiska och användbara saker. Finns i två storlekar.\nSmall: 20 x 27 cm\nLarge: 33 x 43 cm\nThomas Sandell har ritat möbler och andra produkter för ASPLUND sedan 1990. Allt ifrån pallar och stolar till speglar och mattor. Både för ASPLUNDs internationella möbelkollektioner och specialprodukter för deras butiks sortiment. Thomas Sandell är född 1959, arkitekt SIR och SAR. Ordförande i SAR, Svenska Arkitekters Riksförbund, han har genom åren mottagit en rad olika design- och arkitekturutmärkelser. Idag är Sandell en av Sveriges mest framgångsrika designer/arkitekter, med prestigefyllda uppdrag såväl i Sverige som i utlandet."}, "https://distinctive-interiors.com/products/": {"Products | Distinctive Interiors": "Products Living Room View More Bedroom View More Dining Room View More Accent Furniture & Accessories View More Outdoor Furniture View More Customizable Furniture Fabric View More Custom Wall Coverings & Drapery View More Flooring Shoppe View More Hunter Douglas Gallery View More Mattress Gallery View More Check Out Our Current Specials And Events Find Out More"}, "https://runyonsfinefurniture.com/products/alf-bar-stool": {}, "https://www.comfortfurniture.com.sg/sale/products/office": {}, "https://karladubois.com/products/wooster-convertible-crib": {}, "https://brownsquirrelfurniture.com/furniture/rest-bedrooms/rest-beds/sleep-queen/products/laurel-sleigh/": {}, "https://viesso.com/products/haru-bed": {}, "https://floydhome.com/products/the-floyd-hat": {}, "https://www.mybudgetfurniture.com/products/3pc-sectional": {"Sectional + Ottoman Convertible Sleeper – My Budget Furniture": "Sectional + Ottoman Convertible Sleeper\nSectional with matching ottoman\nColor: Blue grey\nMaterial: Linen like\nDimensions:\nSectional: 81\" x 60\" x 34\"H\nOttoman: 45\" x 26\" x 19\"H\nSKU: F6920\nWe Also Recommend\nSectional with matching ottoman\nColor: Blue grey\nMaterial: Linen like\nDimensions:\nSectional: 81\" x 60\" x 34\"H\nOttoman: 45\" x 26\" x 19\"H\nSKU: F6920", "3Pc Sectional - sofa couch – My Budget Furniture": "Sectional and Matching Ottoman\n3Pc Sectional\nMatching ottoman and pillows included\nReversible chaise lounge\nMaterial: Polyfiber / Linen Like\nColor: Sand\nDimensions - Sectional: 104\" x 75\" x 35\"H\nOttoman: 35\" x 24\" x 19\"H\nSKU: F7605\nWe Also Recommend", "Sectional and Matching Ottoman – My Budget Furniture": "Sectional and Matching Ottoman\nMicrofiber sectional with reversible chaise\nAccent pillows and matching ottoman included\nMaterial: Microfiber\nColor: Ebony\nDimensions: 112\" x 84\"\nSKU: F6423\nWe Also Recommend\nMicrofiber sectional with reversible chaise\nAccent pillows and matching ottoman included\nMaterial: Microfiber\nColor: Ebony\nDimensions: 112\" x 84\"\nSKU: F6423", "Sectional + Storage Ottoman – My Budget Furniture": "Sectional + Storage Ottoman\nClassic style sectional with reversible chaise lounge. Matching storage ottoman included.\nColor: Mocha\nMaterial: Fabric\nDimensions: 105\" x 75\" x 35\" H\nSKU: F6544\nWe Also Recommend\nClassic style sectional with reversible chaise lounge. Matching storage ottoman included.\nColor: Mocha\nMaterial: Fabric\nDimensions: 105\" x 75\" x 35\" H\nSKU: F6544", "Sectional and Matching Ottoman Floor Model – My Budget Furniture": "Sectional and Matching Ottoman Floor Model\nSoft cushion and tufted back support. Matching storage ottoman included.\nColor: Dark Grey\nMaterial: Linen\nDimension: 105\" x 77\" x 37\"H\nSKU: F6590\nWe Also Recommend\nSoft cushion and tufted back support. Matching storage ottoman included.\nColor: Dark Grey\nMaterial: Linen\nDimension: 105\" x 77\" x 37\"H\nSKU: F6590"}, "https://www.fiveelementsfurniture.com/collections/sola-office-collection/products/sola-lift-desk": {}, "https://www.fads.co.uk/products/living/sofas/sofa-beds/": {"Buy Sofa Beds at FADS Home Style | Leather & Fabric | Home Furniture": "No products in the basket.\nShowing all 13 results\nKitson Corner Sofa Bed – Various Colours Available\nBrighton Velvet Sofa Bed – Various Colours Available\nLesath Luxury Pull-out Sofa Bed Frame Blue Pinewood\nLesath Luxury Pull-out Sofa Bed Frame Brown Pinewood\nLesath Luxury Pull-out Sofa Bed Frame Honey Brown Pinewood\nLesath Luxury Pull-out Sofa Bed Frame Pinewood\nLesath Luxury Pull-out Sofa Bed Frame White Pinewood\nMeissa Pull-out Metal Sofa Bed Black 200×90 cm\nMeissa Pull-out Metal Sofa Bed Grey 200×90 cm\nMeissa Pull-out Metal Sofa Bed White 200×90 cm\nNico Green Sofa Bed\nPorrima Sofa Bed in Metal Black 200×90 cm\nVogue Leather Sofa Bed\nUsername or email address *\nPassword *\nCaptcha *\nRemember me\nLog in\nLost your password?\nEmail address *\nPassword *\nReceive occasional email offers and vouchers\nYour personal data will be used to support your experience throughout this website, to manage access to your account, and for other purposes described in our privacy policy.\nCaptcha *\nRegister"}, "https://test-danish-inspirations.pantheonsite.io/products/products/bedroom/page/3/": {}, "https://www.hipvan.com/products/sleep-mattress?ref=nav_dropdown": {"SLEEP Mattress, Mattresses by HipVan | HipVan": "Sign up Log in to access your order history, save your favourites and your cart, earn credits & more!\nSign up Log in to write product reviews, save your favourites, access your order history & more!\nSign up Log in for a HipVan user account to retrieve your points.\nEarn $30 credits for every friend you refer!\nSign up Log in to save your favourites and your cart, earn credits, access your order history & more!\nSign up Log in and be notified when it's back in stock!\nSign up Log in to continue supporting the community's countless inspiring posts!\nSign up Log in to continue supporting what other community members have to say!\nSign up Log in to leave supportive messages and burning questions on homeowners' posts!\nSign up Log in to easily keep track of your favourite homeowners' posts!\nSign up Log in to showcase your home to >200,000 members in the community!\nSign up Log in to interact and learn from other homeowners to better furnish your own home!\nSign up Log in to curate your inspirational moodboard and refer to it easily anytime, anywhere.\nEnter the email address associated with your account, and we'll email you a link to reset your password.\nA link to reset your password has been sent to"}, "https://dev-danish-inspirations.pantheonsite.io/products/products/bedroom/page/3/": {}, "https://houseofhollingsworthblog.com/products/locker": {}, "https://www.wardrobe-bunk-bed-sofa.uk/products/wardrobe-ava-4-3": {}, "https://dwell.co.uk/products/sleep/type/bed/": {"Contemporary Beds & Mattresses | dwell": "0345 013 0515\nWishlist\nShowrooms\nAccount\nBasket\n100s of products available for\nfast delivery* | 0% Interest Free Credit\nHurry, while stocks last"}, "https://www.hopewells.co.uk/products/living-dining/sofas-chairs/tetrad/tetrad-patna-chair": {}, "https://kokocollective.com.au/products/esme-natural-rattan-day-bed": {}, "https://www.timothyoulton.com/products/living/sectional-sofas": {"Leather, Linen, & Velvet Sectional Sofas by Timothy Oulton - Timothy Oulton": "Join the owners' club\nThe beauty of a sectional sofa is that it can be configured to fit any space. Our sectionals are available in over 40 fabrics including leather, linen and velvet, click on the product to see the full range of materials available for each model. Favourite leather sectional sofas include Shabby, perfect for sociable get-togethers, while linen sectional sofas such as Nest offer the ultimate chill-out.\nRegister or sign in"}, "https://www.warmnordic.com/global/products/news": {"news – Warm Nordic": "-\n-\nSERIER\n-\nINSPIRATION\n-\n- Awards\n- Cone serien – lys til enhver lejlighed\n- Designklassikere til det moderne hjem\n- Dwell loungeserie\n- En royal hyldest til dansk design\n- Fried Egg sofa\n- Fringe – den ikoniske frynselampe\n- Idéer til kontoret\n- Jo Hammerborg\n- Naturlige materialer og æstetisk design\n- Swing gyngestol\n- Wingman Lounge Chair\n- 5 klassiske lænestole\n-\n-\n-\n- ARCHIVE SALE\n- NYHEDER\n- Kundeservice\n- Find store\n- Presse\n- All collections\n-\n-\nSERIER\n-\nINSPIRATION\n-\n- Awards\n- Cone serien – lys til enhver lejlighed\n- Designklassikere til det moderne hjem\n- Dwell loungeserie\n- En royal hyldest til dansk design\n- Fried Egg sofa\n- Fringe – den ikoniske frynselampe\n- Idéer til kontoret\n- Jo Hammerborg\n- Naturlige materialer og æstetisk design\n- Swing gyngestol\n- Wingman Lounge Chair\n- 5 klassiske lænestole\n-\n-\n-\n- ARCHIVE SALE\n- NYHEDER\n- Kundeservice\n- Find store\n- Presse\n- All collections\n-\n-\nSERIER\n- Møbler\n- Belysning\n- Accessories\n- Collections\n-\nINSPIRATION\n-\nInspiration\n- Awards\n- Cone serien – lys til enhver lejlighed\n- Designklassikere til det moderne hjem\n- Dwell loungeserie\n- En royal hyldest til dansk design\n- Fried Egg sofa\n- Fringe – den ikoniske frynselampe\n- Idéer til kontoret\n- Jo Hammerborg\n- Naturlige materialer og æstetisk design\n- Swing gyngestol\n- Wingman Lounge Chair\n- 5 klassiske lænestole\n- Warm Nordics historie\n- Kataloger\n- Inspiration\n- ARCHIVE SALE\n- NYHEDER\n- Kundeservice\n- Find store\n- Presse\n- All collections"}, "https://www.royaloakfurniture.co.uk/products/pop-bench": {"Arncliffe Pop Bench – Royal Oak Furniture Company": "Handmade solid Oak bench. Beautifully simple with a gently curved seat, softened edges and tapered legs.\nW86cm x D30cm x H47cm\nAlso available as a stool.\nRegular priceSale price\n£430.00\nUnit price/ per\nTax included.\nFURNITURE DELIVERY TIMES: For items made to order our lead time is 6 - 12 weeks.\nItems marked 'In stock for quicker delivery' are usually delivered within 2 - 6 weeks. We will contact you to confirm the details of your order, including colour and finish, and discuss delivery dates.\nHOMEWARES AND GIFTS: All items in our Homewares and Gifts Collection are in stock and will be delivered within 3-7 days.\nIf for any reason there is a delay in sending these items out we will contact you to let you know."}, "https://mulamu.com/products/membership": {"MEMBERSHIP - Mulamu Furnishings": "Whatsapp: 6341 6180\nEmail: sales@mulamu.com\nHave a question? Send us a message!\nWe are a team of quirky, enigmatic, outspoken and design-loving Singaporeans who share a love for high quality furnishings that boast unique designs. Our vision is to bring these features to everyone whilst doing so at competitive rates. Read more.\nSign up to get the latest on sales, new releases and more …\nBe the first to know about our latest happenings\nWe welcome you to join our mailing list to stay updated on our latest promotions...and enjoy exclusive discounts too!"}, "http://www.genesisfurniturelv.com/products/": {"Browse by Brand: – Genesis Furniture": "Search for:\nHome\nCategories\nBedroom\nMaster Bedroom\nKids Bedroom\nLiving Rooms\nSeating\nTV Stands & Ent. Centers\nOccasional\nFutons\nDining Room\nLighting\nFloor Lamps\nTable Lamps\nAccents\nAccent Chairs\nPayment Options\nAbout Us\nContact Us\nBrowse by Brand\nMenu\nHome\nBrowse by Brand\nBrowse by Category\nBedroom\nMaster Bedroom\nKids Bedroom\nLiving Room\nSeating\nTV Stands & Ent. Centers\nOccasional\nFutons\nDining Room\nLighting\nFloor Lamps\nTable Lamps\nAccents\nAccent Chairs\nPayment Options\nAbout Us\nContact Us"}, "https://daufurniture.com/products/style/transitional/dana-upholstered-bed/": {}, "https://www.waynesfinefurnitureandbedding.com/search/products/?s=power+recliners&pp=120": {}, "https://theodores.com/products/": {"Modern Furniture Washington DC - Cantoni": "Cantoni Modern Furniture Washington DC\nSat: 10am - 6pm\nSun: 1pm - 5pm\nTop Selling Brands in Washington DC\nMeet our Designers\nAbout the Store\nTheodores by Cantoni debuted in 1969 originally as Theodores and has since revolutionized the modern home furnishing market in the Washington metropolitan area. From the beginning, their mission has always been to continually search for modern home furnishings with the best design, quality, and value. Now operated by the Cantoni Group starting in August of 2023, Theodores by Cantoni takes the same mission and elevates it further, with a truly next-level experience that makes it easy to shop, customize, and get the design help that you need all in one convenient location.\nOur 10,000-square-foot showroom is located in Upper Georgetown, putting it in a prime spot for modern design lovers in Washington D.C., as well as Northern Virginia and Maryland, which are only minutes away. Stepping into our showroom, you can expect to find renowned brands from all over the world situated in an inspiring atmosphere that makes it easy to visualize each piece in a lifestyle setting. Don’t see what you’re looking for? Not a problem! We have the capabilities to customize many of our items to perfectly suit your desires and home requirements.\nAnd if you’re unsure or just need a few questions answered, our talented design consultants are sure to put your mind at ease. With their expertise and willingness to provide you with the best experience, they are fully equipped to answer any question that you may have. Tackling a bigger project? Our designers are here to help. From start to finish, our team can work with you on your residential or commercial project with services that include but are not limited to space planning, interior finishes, lighting selection, custom closet, kitchen and bathroom design, and so much more\nTheodores by Cantoni is located in Upper Georgetown at 2233 Wisconsin Ave NW, in Washington D.C. Be sure and visit our showroom often, as we’re always receiving new stock to ensure that you’re met with the latest and greatest in modern design.\nFurniture Product line, loves furniture, furniture stores near me, local furniture stores near me, furniture store, modern organic furniture Washington DC, garden furniture Washington DC, modern outdoor furniture Washington DC, Cattelan Italia Washington DC, Gamma Washington DC, BDi Furniture Washington DC, American leather Washington DC, Italian modern furniture Washington DC, European modern furniture Washington DC, European style furniture Washington DC, European furniture Washington DC, buy Cattelan furniture Washington DC, Cattelan Italia Furniture Washington DC, Buy Gamma furniture Washington DC, Gamma furniture Washington DC, Cattelan Washington DC,"}, "https://www.theoakfurnitureshop.com/products/country-trend-solid-oak-tv-stand-51/": {}, "https://totalpatioaccessories.com/products/product07": {}, "https://www.groensfinefurniture.com/products/Miscellaneous/misc/394554.html": {}, "https://yesterdaystreefurniture.com/products/gifts/": {}, "https://www.jensen-lewis.com/products/guardsman-gold-complete-plan": {"Guardsman Protection Plan - Furniture Accident Insurance": "Guardsman's comprehensive Furniture Protection Plan protects your new fabric, leather, and wood furniture investment for a period of 5 years.\nGuardsman Gold Complete Plus Furniture Protection Plans cover the accidental stains and damage of a life well-lived. When you need us, we’ll send an expert technician to restore your fabric, leather, wood, and other hard-surface furniture to a look you’ll love a long, long time\n*Guardsman plan must be purchased prior to furniture delivery.\nGuardsman Gold Complete Plus Plan Brochure\nGuardsman Gold Complete Plus Plan Contract"}, "https://www.popandscott.com/products/raffia-sun": {}, "https://shophorne.com/products/sarpaneva-cast-iron-casserole": {}, "https://cultdesign.co.nz/products/molloy-chair": {"Molloy Chair\n– Cult - Design First": "This item is part of our Considered Collection\nElegantly sculptural, the Molloy collection of dining tables, chairs, shelving and coffee tables feature fluid detailing inspired by a rare act of nature.\nThe idea for the artfully rounded joinery, where two elements meet and seamlessly become one, comes from the unusual meeting of two rivers to form the Molloy River in Western Australia – a place where Adam Goodrum hand-built a holiday home with his family. The Molloy collection is available in a variety of timber finishes.\nWinner of the Good Design Awards 2016.\nProduct made from sustainably sourced materials with a lower environmental impact than conventional alternatives.\n52W x 50D x 78H cm\n45cm seat height\nDownload NAU Standards Finishes and Upholstery Overview\nSolid timber in oak, walnut, ash or black stained ash.\nA firm believer that every environment is defined by the objects within it, Adam Goodrum designs with the philosophy that an object must therefore justify its existence – through its story and detailing. For this reason, his designs celebrate process and craftsmanship, and accentuate components and joinery to create functional pieces with spirit and personality. In recent years, Goodrum’s work has been awarded a host of design accolades including the NGV Rigg Prize, Vogue x Alessi Design Prize, Indesign Luminary Award and the Idea Awards Editor’s Medal. He has also been commissioned to design pieces for several global luxury brands including Veuve Clicquot, Alessi and Cappellini.", "Molloy Chair with arms\n– Cult - Design First": "This item is part of our Considered Collection\nElegantly sculptural, the Molloy collection of dining tables, chairs, shelving and coffee tables feature fluid detailing inspired by a rare act of nature.\nThe idea for the artfully rounded joinery, where two elements meet and seamlessly become one, comes from the unusual meeting of two rivers to form the Molloy River in Western Australia – a place where Adam Goodrum hand-built a holiday home with his family. The Molloy collection is available in a variety of timber finishes.\nWinner of the Good Design Award 2019.\nProduct made from sustainably sourced materials with a lower environmental impact than conventional alternatives.\n59W x 50D x 78H cm\n45cm seat height\nDownload NAU Standards Finishes and Upholstery Overview\nSolid timber in oak, walnut, ash or black stained ash.\nA firm believer that every environment is defined by the objects within it, Adam Goodrum designs with the philosophy that an object must therefore justify its existence – through its story and detailing. For this reason, his designs celebrate process and craftsmanship, and accentuate components and joinery to create functional pieces with spirit and personality. In recent years, Goodrum’s work has been awarded a host of design accolades including the NGV Rigg Prize, Vogue x Alessi Design Prize, Indesign Luminary Award and the Idea Awards Editor’s Medal. He has also been commissioned to design pieces for several global luxury brands including Veuve Clicquot, Alessi and Cappellini."}}